src/test/resources/benchmark_out/2024-08-03/macpro_max_16_m1/out_openpdf.log
starting benchmark...
spawning thread #0: 15 total client(s). 12500 total requests
spawning thread #1: 15 total client(s). 12500 total requests
spawning thread #2: 15 total client(s). 12500 total requests
spawning thread #3: 15 total client(s). 12500 total requests
Application protocol: h2c
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 53.42s, 936.05 req/s, 8.89MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 474.75MB (497812980) total, 148.42KB (151980) headers (space savings 94.54%), 473.51MB (496509560) data
                     min         max         mean         sd        +/- sd
time for request:      377us    633.19ms     63.04ms     61.73ms    82.45%
time for connect:      693us      1.95ms      1.77ms       252us    90.00%
time to 1st byte:     5.45ms    196.79ms     45.41ms     60.55ms    85.00%
req/s           :      15.59       16.53       15.86        0.22    70.00%