src/test/resources/benchmark_out/2024-08-03/macpro_max_16_m1/out_pdf-fop-pool.log
starting benchmark...
spawning thread #0: 15 total client(s). 12500 total requests
spawning thread #1: 15 total client(s). 12500 total requests
spawning thread #2: 15 total client(s). 12500 total requests
spawning thread #3: 15 total client(s). 12500 total requests
Application protocol: h2c
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 20.81s, 2402.76 req/s, 40.28MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 838.19MB (878903320) total, 148.48KB (152040) headers (space savings 94.57%), 836.66MB (877299960) data
                     min         max         mean         sd        +/- sd
time for request:     1.64ms    295.84ms     24.68ms     24.82ms    87.16%
time for connect:      749us      2.00ms      1.77ms       235us    90.00%
time to 1st byte:    12.82ms    202.55ms     66.93ms     46.81ms    73.33%
req/s           :      40.03       42.35       40.48        0.50    90.00%