src/test/resources/benchmark_out/2024-08-03/macpro_max_16_m1/out_pdf-fop.log
starting benchmark...
spawning thread #0: 15 total client(s). 12500 total requests
spawning thread #1: 15 total client(s). 12500 total requests
spawning thread #2: 15 total client(s). 12500 total requests
spawning thread #3: 15 total client(s). 12500 total requests
Application protocol: h2c
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 28.05s, 1782.40 req/s, 29.88MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 838.19MB (878903320) total, 148.48KB (152040) headers (space savings 94.57%), 836.66MB (877299960) data
                     min         max         mean         sd        +/- sd
time for request:     1.79ms    458.13ms     33.06ms     38.98ms    88.56%
time for connect:      869us      2.12ms      1.72ms       228us    83.33%
time to 1st byte:    13.58ms    454.38ms     74.24ms     73.43ms    83.33%
req/s           :      29.70       31.67       30.24        0.51    78.33%